20240114063840-static_imports.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Static Imports</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Static Imports</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org710ae31">1. Static Imports</a>
<ul>
<li><a href="#orga26859d">1.1. Example (Regular Import)</a></li>
<li><a href="#orgda9d1ee">1.2. Example (Static Import)</a>
<ul>
<li><a href="#org4a0cf74">1.2.1. Negative Example</a></li>
<li><a href="#orgeeb793c">1.2.2. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org710ae31" class="outline-2">
<h2 id="org710ae31"><span class="section-number-2">1.</span> Static Imports</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Regular imports</b> are for importing <code>classes</code>, while <b>static imports</b> are for importing <code>static</code> members of <code>classes</code> like <b>variables</b> and <b>methods</b>.
</p>


<p>
Just like regular imports, you can use a <b>wildcard</b> or import a <b>specific member</b>.
The idea is that you shouldn’t have to specify where <b>each</b> <code>static</code> method or variable comes from each time you use it.
</p>

<p>
An example of when <code>static imports</code> shine is when you are referring to a lot of constants in another <code>class</code>.
</p>
</div>

<div id="outline-container-orga26859d" class="outline-3">
<h3 id="orga26859d"><span class="section-number-3">1.1.</span> Example (Regular Import)</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">List</span>;
<span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">Arrays</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Imports</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt; <span class="org-variable-name">list</span> = Arrays.asList(<span class="org-string">"one"</span>, <span class="org-string">"two"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda9d1ee" class="outline-3">
<h3 id="orgda9d1ee"><span class="section-number-3">1.2.</span> Example (Static Import)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In this example, we are specifically importing the <code>asList</code> method.
This means that any time we refer to <code>asList</code> in the <code>class</code>, it will call <code>Arrays.asList()</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">List</span>;
<span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.Arrays.<span class="org-type">asList</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">static import
</span>
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">ZooParking</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">List</span>&lt;<span class="org-type">String</span>&gt; <span class="org-variable-name">list</span> = asList(<span class="org-string">"one"</span>, <span class="org-string">"two"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">No Arrays. prefix
</span>    }
}
</pre>
</div>
</div>

<div id="outline-container-org4a0cf74" class="outline-4">
<h4 id="org4a0cf74"><span class="section-number-4">1.2.1.</span> Negative Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-type">Arrays</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE (Tries to use a static import to import a class)
</span><span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.Arrays.<span class="org-type">asList</span>;
<span class="org-keyword">static</span> <span class="org-keyword">import</span> <span class="org-constant">java</span>.<span class="org-constant">util</span>.<span class="org-constant">Arrays</span>.*; <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">BadZooParking</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        Arrays.asList(<span class="org-string">"one"</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE (Should just be asList("One");)
</span>    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeeb793c" class="outline-4">
<h4 id="orgeeb793c"><span class="section-number-4">1.2.2.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
In <a href="20231229153446-1_building_blocks.html#ID-34f737cd-7010-42aa-9f37-5136eb75a44e">1. Building blocks</a>, you learned that importing <b>two</b> <code>classes</code> with the same name gives a <b>compiler error</b>.
This is <b>true</b> of <code>static</code> imports as well.
</p>

<p>
The compiler will complain if you try to explicitly do a <code>static import</code> of two <a href="20240113065453-static_methods.html#ID-71f8ac46-9cca-4866-b701-8f5a7f9f7fc0">static methods</a> with the <b>same</b> name or two <a href="20240113065406-static_variable.html#ID-90b4776a-f230-4e13-b1a1-248b48026677">static variables</a> with the <b>same</b> name.
</p>

<p>
Here’s an example:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">zoo</span>.<span class="org-constant">A</span>.<span class="org-type">TYPE</span>;
<span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">zoo</span>.<span class="org-constant">B</span>.<span class="org-type">TYPE</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE</span>
</pre>
</div>

<p>
Luckily, when this happens, we can just refer to the <code>static</code> members via their <code>class</code> name in the code instead of trying to use a <code>static import</code>.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
